waterChannel/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(rhoPhi,U)	Gauss linearUpwind grad(U);
    div(phi,alpha)	Gauss vanLeer;
    div(phirb,alpha)	Gauss linear;
    div(phid1,p_rgh)	Gauss upwind;
    div(phid2,p_rgh)	Gauss upwind;
    div(rhoPhi,T)	Gauss linearUpwind unlimited;
    div(rhoPhi,K)	Gauss upwind;
    div(phi,k)		Gauss upwind;
    div(phi,omega)	bounded Gauss upwind;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,symm(grad(U))) bounded Gauss limitedLinear 1;
//    div((muEff*dev2(T(grad(U))))) Gauss linear;
//    div((muEff*dev(T(grad(U))))) Gauss linear;
}


laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
